MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1064DAB169/mcu.h
extern volatile __C1RXF30bits_t C1RXF30bits __asm__ ("C1RXF30") __attribute__((section("sfrs"), address(0xBF880320)));
extern volatile uint32_t        C1RXF30CLR __attribute__((section("sfrs"),address(0xBF880324)));
extern volatile uint32_t        C1RXF30SET __attribute__((section("sfrs"),address(0xBF880328)));
extern volatile uint32_t        C1RXF30INV __attribute__((section("sfrs"),address(0xBF88032C)));
#define C1RXF31 C1RXF31
extern volatile uint32_t   C1RXF31 __attribute__((section("sfrs"), address(0xBF880330)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF31bits_t;
extern volatile __C1RXF31bits_t C1RXF31bits __asm__ ("C1RXF31") __attribute__((section("sfrs"), address(0xBF880330)));
extern volatile uint32_t        C1RXF31CLR __attribute__((section("sfrs"),address(0xBF880334)));
extern volatile uint32_t        C1RXF31SET __attribute__((section("sfrs"),address(0xBF880338)));
extern volatile uint32_t        C1RXF31INV __attribute__((section("sfrs"),address(0xBF88033C)));
#define C1FIFOBA C1FIFOBA
extern volatile uint32_t   C1FIFOBA __attribute__((section("sfrs"), address(0xBF880340)));
extern volatile uint32_t        C1FIFOBACLR __attribute__((section("sfrs"),address(0xBF880344)));
extern volatile uint32_t        C1FIFOBASET __attribute__((section("sfrs"),address(0xBF880348)));
extern volatile uint32_t        C1FIFOBAINV __attribute__((section("sfrs"),address(0xBF88034C)));
#define C1FIFOCON0 C1FIFOCON0
extern volatile uint32_t   C1FIFOCON0 __attribute__((section("sfrs"), address(0xBF880350)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON0bits_t;
extern volatile __C1FIFOCON0bits_t C1FIFOCON0bits __asm__ ("C1FIFOCON0") __attribute__((section("sfrs"), address(0xBF880350)));
extern volatile uint32_t        C1FIFOCON0CLR __attribute__((section("sfrs"),address(0xBF880354)));
extern volatile uint32_t        C1FIFOCON0SET __attribute__((section("sfrs"),address(0xBF880358)));
extern volatile uint32_t        C1FIFOCON0INV __attribute__((section("sfrs"),address(0xBF88035C)));
#define C1FIFOINT0 C1FIFOINT0
extern volatile uint32_t   C1FIFOINT0 __attribute__((section("sfrs"), address(0xBF880360)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT0bits_t;
extern volatile __C1FIFOINT0bits_t C1FIFOINT0bits __asm__ ("C1FIFOINT0") __attribute__((section("sfrs"), address(0xBF880360)));
extern volatile uint32_t        C1FIFOINT0CLR __attribute__((section("sfrs"),address(0xBF880364)));
extern volatile uint32_t        C1FIFOINT0SET __attribute__((section("sfrs"),address(0xBF880368)));
extern volatile uint32_t        C1FIFOINT0INV __attribute__((section("sfrs"),address(0xBF88036C)));
#define C1FIFOUA0 C1FIFOUA0
extern volatile uint32_t   C1FIFOUA0 __attribute__((section("sfrs"), address(0xBF880370)));
extern volatile uint32_t        C1FIFOUA0CLR __attribute__((section("sfrs"),address(0xBF880374)));
extern volatile uint32_t        C1FIFOUA0SET __attribute__((section("sfrs"),address(0xBF880378)));
extern volatile uint32_t        C1FIFOUA0INV __attribute__((section("sfrs"),address(0xBF88037C)));
#define C1FIFOCI0 C1FIFOCI0
extern volatile uint32_t   C1FIFOCI0 __attribute__((section("sfrs"), address(0xBF880380)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI0bits_t;
extern volatile __C1FIFOCI0bits_t C1FIFOCI0bits __asm__ ("C1FIFOCI0") __attribute__((section("sfrs"), address(0xBF880380)));
extern volatile uint32_t        C1FIFOCI0CLR __attribute__((section("sfrs"),address(0xBF880384)));
extern volatile uint32_t        C1FIFOCI0SET __attribute__((section("sfrs"),address(0xBF880388)));
extern volatile uint32_t        C1FIFOCI0INV __attribute__((section("sfrs"),address(0xBF88038C)));
#define C1FIFOCON1 C1FIFOCON1
extern volatile uint32_t   C1FIFOCON1 __attribute__((section("sfrs"), address(0xBF880390)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON1bits_t;
extern volatile __C1FIFOCON1bits_t C1FIFOCON1bits __asm__ ("C1FIFOCON1") __attribute__((section("sfrs"), address(0xBF880390)));
extern volatile uint32_t        C1FIFOCON1CLR __attribute__((section("sfrs"),address(0xBF880394)));
extern volatile uint32_t        C1FIFOCON1SET __attribute__((section("sfrs"),address(0xBF880398)));
extern volatile uint32_t        C1FIFOCON1INV __attribute__((section("sfrs"),address(0xBF88039C)));
#define C1FIFOINT1 C1FIFOINT1
extern volatile uint32_t   C1FIFOINT1 __attribute__((section("sfrs"), address(0xBF8803A0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT1bits_t;
extern volatile __C1FIFOINT1bits_t C1FIFOINT1bits __asm__ ("C1FIFOINT1") __attribute__((section("sfrs"), address(0xBF8803A0)));
extern volatile uint32_t        C1FIFOINT1CLR __attribute__((section("sfrs"),address(0xBF8803A4)));
extern volatile uint32_t        C1FIFOINT1SET __attribute__((section("sfrs"),address(0xBF8803A8)));
extern volatile uint32_t        C1FIFOINT1INV __attribute__((section("sfrs"),address(0xBF8803AC)));
#define C1FIFOUA1 C1FIFOUA1
extern volatile uint32_t   C1FIFOUA1 __attribute__((section("sfrs"), address(0xBF8803B0)));
extern volatile uint32_t        C1FIFOUA1CLR __attribute__((section("sfrs"),address(0xBF8803B4)));
extern volatile uint32_t        C1FIFOUA1SET __attribute__((section("sfrs"),address(0xBF8803B8)));
extern volatile uint32_t        C1FIFOUA1INV __attribute__((section("sfrs"),address(0xBF8803BC)));
#define C1FIFOCI1 C1FIFOCI1
extern volatile uint32_t   C1FIFOCI1 __attribute__((section("sfrs"), address(0xBF8803C0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI1bits_t;
extern volatile __C1FIFOCI1bits_t C1FIFOCI1bits __asm__ ("C1FIFOCI1") __attribute__((section("sfrs"), address(0xBF8803C0)));
extern volatile uint32_t        C1FIFOCI1CLR __attribute__((section("sfrs"),address(0xBF8803C4)));
extern volatile uint32_t        C1FIFOCI1SET __attribute__((section("sfrs"),address(0xBF8803C8)));
extern volatile uint32_t        C1FIFOCI1INV __attribute__((section("sfrs"),address(0xBF8803CC)));
#define C1FIFOCON2 C1FIFOCON2
extern volatile uint32_t   C1FIFOCON2 __attribute__((section("sfrs"), address(0xBF8803D0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON2bits_t;
extern volatile __C1FIFOCON2bits_t C1FIFOCON2bits __asm__ ("C1FIFOCON2") __attribute__((section("sfrs"), address(0xBF8803D0)));
extern volatile uint32_t        C1FIFOCON2CLR __attribute__((section("sfrs"),address(0xBF8803D4)));
extern volatile uint32_t        C1FIFOCON2SET __attribute__((section("sfrs"),address(0xBF8803D8)));
extern volatile uint32_t        C1FIFOCON2INV __attribute__((section("sfrs"),address(0xBF8803DC)));
#define C1FIFOINT2 C1FIFOINT2
extern volatile uint32_t   C1FIFOINT2 __attribute__((section("sfrs"), address(0xBF8803E0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT2bits_t;
extern volatile __C1FIFOINT2bits_t C1FIFOINT2bits __asm__ ("C1FIFOINT2") __attribute__((section("sfrs"), address(0xBF8803E0)));
extern volatile uint32_t        C1FIFOINT2CLR __attribute__((section("sfrs"),address(0xBF8803E4)));
extern volatile uint32_t        C1FIFOINT2SET __attribute__((section("sfrs"),address(0xBF8803E8)));
extern volatile uint32_t        C1FIFOINT2INV __attribute__((section("sfrs"),address(0xBF8803EC)));
#define C1FIFOUA2 C1FIFOUA2
extern volatile uint32_t   C1FIFOUA2 __attribute__((section("sfrs"), address(0xBF8803F0)));
extern volatile uint32_t        C1FIFOUA2CLR __attribute__((section("sfrs"),address(0xBF8803F4)));
extern volatile uint32_t        C1FIFOUA2SET __attribute__((section("sfrs"),address(0xBF8803F8)));
extern volatile uint32_t        C1FIFOUA2INV __attribute__((section("sfrs"),address(0xBF8803FC)));
#define C1FIFOCI2 C1FIFOCI2
extern volatile uint32_t   C1FIFOCI2 __attribute__((section("sfrs"), address(0xBF880400)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI2bits_t;
