MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1064DAB169/mcu.h
#define _GLCDCLUT86_BLUE_POSITION                0x00000000
#define _GLCDCLUT86_BLUE_MASK                    0x000000FF
#define _GLCDCLUT86_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT86_GREEN_POSITION               0x00000008
#define _GLCDCLUT86_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT86_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT86_RED_POSITION                 0x00000010
#define _GLCDCLUT86_RED_MASK                     0x00FF0000
#define _GLCDCLUT86_RED_LENGTH                   0x00000008

#define _GLCDCLUT87_BLUE_POSITION                0x00000000
#define _GLCDCLUT87_BLUE_MASK                    0x000000FF
#define _GLCDCLUT87_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT87_GREEN_POSITION               0x00000008
#define _GLCDCLUT87_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT87_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT87_RED_POSITION                 0x00000010
#define _GLCDCLUT87_RED_MASK                     0x00FF0000
#define _GLCDCLUT87_RED_LENGTH                   0x00000008

#define _GLCDCLUT88_BLUE_POSITION                0x00000000
#define _GLCDCLUT88_BLUE_MASK                    0x000000FF
#define _GLCDCLUT88_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT88_GREEN_POSITION               0x00000008
#define _GLCDCLUT88_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT88_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT88_RED_POSITION                 0x00000010
#define _GLCDCLUT88_RED_MASK                     0x00FF0000
#define _GLCDCLUT88_RED_LENGTH                   0x00000008

#define _GLCDCLUT89_BLUE_POSITION                0x00000000
#define _GLCDCLUT89_BLUE_MASK                    0x000000FF
#define _GLCDCLUT89_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT89_GREEN_POSITION               0x00000008
#define _GLCDCLUT89_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT89_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT89_RED_POSITION                 0x00000010
#define _GLCDCLUT89_RED_MASK                     0x00FF0000
#define _GLCDCLUT89_RED_LENGTH                   0x00000008

#define _GLCDCLUT90_BLUE_POSITION                0x00000000
#define _GLCDCLUT90_BLUE_MASK                    0x000000FF
#define _GLCDCLUT90_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT90_GREEN_POSITION               0x00000008
#define _GLCDCLUT90_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT90_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT90_RED_POSITION                 0x00000010
#define _GLCDCLUT90_RED_MASK                     0x00FF0000
#define _GLCDCLUT90_RED_LENGTH                   0x00000008

#define _GLCDCLUT91_BLUE_POSITION                0x00000000
#define _GLCDCLUT91_BLUE_MASK                    0x000000FF
#define _GLCDCLUT91_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT91_GREEN_POSITION               0x00000008
#define _GLCDCLUT91_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT91_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT91_RED_POSITION                 0x00000010
#define _GLCDCLUT91_RED_MASK                     0x00FF0000
#define _GLCDCLUT91_RED_LENGTH                   0x00000008

#define _GLCDCLUT92_BLUE_POSITION                0x00000000
#define _GLCDCLUT92_BLUE_MASK                    0x000000FF
#define _GLCDCLUT92_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT92_GREEN_POSITION               0x00000008
#define _GLCDCLUT92_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT92_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT92_RED_POSITION                 0x00000010
#define _GLCDCLUT92_RED_MASK                     0x00FF0000
#define _GLCDCLUT92_RED_LENGTH                   0x00000008

#define _GLCDCLUT93_BLUE_POSITION                0x00000000
#define _GLCDCLUT93_BLUE_MASK                    0x000000FF
#define _GLCDCLUT93_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT93_GREEN_POSITION               0x00000008
#define _GLCDCLUT93_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT93_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT93_RED_POSITION                 0x00000010
#define _GLCDCLUT93_RED_MASK                     0x00FF0000
#define _GLCDCLUT93_RED_LENGTH                   0x00000008

#define _GLCDCLUT94_BLUE_POSITION                0x00000000
#define _GLCDCLUT94_BLUE_MASK                    0x000000FF
#define _GLCDCLUT94_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT94_GREEN_POSITION               0x00000008
#define _GLCDCLUT94_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT94_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT94_RED_POSITION                 0x00000010
#define _GLCDCLUT94_RED_MASK                     0x00FF0000
#define _GLCDCLUT94_RED_LENGTH                   0x00000008

#define _GLCDCLUT95_BLUE_POSITION                0x00000000
#define _GLCDCLUT95_BLUE_MASK                    0x000000FF
#define _GLCDCLUT95_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT95_GREEN_POSITION               0x00000008
#define _GLCDCLUT95_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT95_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT95_RED_POSITION                 0x00000010
#define _GLCDCLUT95_RED_MASK                     0x00FF0000
#define _GLCDCLUT95_RED_LENGTH                   0x00000008

#define _GLCDCLUT96_BLUE_POSITION                0x00000000
#define _GLCDCLUT96_BLUE_MASK                    0x000000FF
#define _GLCDCLUT96_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT96_GREEN_POSITION               0x00000008
#define _GLCDCLUT96_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT96_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT96_RED_POSITION                 0x00000010
#define _GLCDCLUT96_RED_MASK                     0x00FF0000
#define _GLCDCLUT96_RED_LENGTH                   0x00000008

#define _GLCDCLUT97_BLUE_POSITION                0x00000000
#define _GLCDCLUT97_BLUE_MASK                    0x000000FF
#define _GLCDCLUT97_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT97_GREEN_POSITION               0x00000008
#define _GLCDCLUT97_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT97_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT97_RED_POSITION                 0x00000010
#define _GLCDCLUT97_RED_MASK                     0x00FF0000
#define _GLCDCLUT97_RED_LENGTH                   0x00000008

#define _GLCDCLUT98_BLUE_POSITION                0x00000000
#define _GLCDCLUT98_BLUE_MASK                    0x000000FF
#define _GLCDCLUT98_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT98_GREEN_POSITION               0x00000008
#define _GLCDCLUT98_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT98_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT98_RED_POSITION                 0x00000010
#define _GLCDCLUT98_RED_MASK                     0x00FF0000
#define _GLCDCLUT98_RED_LENGTH                   0x00000008

#define _GLCDCLUT99_BLUE_POSITION                0x00000000
#define _GLCDCLUT99_BLUE_MASK                    0x000000FF
#define _GLCDCLUT99_BLUE_LENGTH                  0x00000008

#define _GLCDCLUT99_GREEN_POSITION               0x00000008
#define _GLCDCLUT99_GREEN_MASK                   0x0000FF00
#define _GLCDCLUT99_GREEN_LENGTH                 0x00000008

#define _GLCDCLUT99_RED_POSITION                 0x00000010
#define _GLCDCLUT99_RED_MASK                     0x00FF0000
#define _GLCDCLUT99_RED_LENGTH                   0x00000008

